demo-output/website/campaign/F4_runs/cyl/M6.0/medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       7860;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7960;
    }
    farfield
    {
        type            patch;
        nFaces          100;
        startFace       8000;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       8100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000;
        startFace       8140;
    }
)

// ************************************************************************* //
